simonqq21/esp8266_wifi_config/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <LittleFS.h> 
#include <EEPROM.h>

#define START_ADDR 0x0

// read from the EEPROM. If the EEPROM contents are valid, it must be 1024.
// If it is any other value, EEPROM contents are invalid.
int checkNum; 
String ssid, pass;
int ipIndex;
String newSsid, newPass;
unsigned long checkAddr, ssidAddr, passAddr;

AsyncWebServer server(80); 
AsyncWebSocket ws("/ws"); 
File indexPage;  

IPAddress localIP; 
IPAddress apIP;


AsyncWebHandler indexHandler, wifiHandler; 

// void writeStrToEEPROM(unsigned int addr, String str) {
//   int len = str.length(); 
//   Serial.print("len=");
//   Serial.println(len);
//   for (int i=0;i<len;i++) {
//     EEPROM.write(addr+i, str[i]);
//   }
//   EEPROM.write(addr+len, 0);
// }

// void readStrFromEEPROM(unsigned int addr, String str) {
//   byte ch;
//   int i = 0;
//   do
//   {
//     ch = EEPROM.read(addr+i);
//     Serial.println(ch);
//     str.setCharAt(addr+i, ch);
//     i++;
//   } while (ch);
//   Serial.print("str in funcion = ");
//   Serial.println(str);
// }



void setup() {
  Serial.begin(115200);

  // littleFS 
  if (!LittleFS.begin()) {
    Serial.println("An error occured while mounting LittleFS.");
  }
  
  // initialize EEPROM
  EEPROM.begin(sizeof(int) + sizeof(char) * 160);
  checkAddr = START_ADDR;
  ssidAddr = checkAddr + sizeof(char) * 64;
  passAddr = ssidAddr + sizeof(char) * 64;

  /*
  read from the EEPROM. If the EEPROM contents are valid, it must be 1024.
  If it is any other value, EEPROM contents are invalid, then the EEPROM 
  will be set to default valid string values. 
  */
  // EEPROM.put(checkAddr, 0);
  // EEPROM.commit();
  EEPROM.get(checkAddr, checkNum);
  Serial.print(checkNum); 
  checkNum = 0;
  if (checkNum != 1024) {
    ssid = "wifi";
    pass = "password";
    EEPROM.put(checkAddr, 1024);
    EEPROM.put(ssidAddr, ssid);
    EEPROM.put(passAddr, pass);
    EEPROM.commit();

    Serial.print("ssid=");
    Serial.println(newSsid);
    Serial.print("pass=");
    Serial.println(newPass);

    EEPROM.get(ssidAddr, newSsid);
    EEPROM.get(passAddr, newPass);
    EEPROM.get(ssidAddr, ssid);
    EEPROM.get(passAddr, pass); 

    Serial.print("ssid=");
    Serial.println(newSsid);
    Serial.print("pass=");
    Serial.println(newPass);
    Serial.println("EEPROM initialized!");
  }
  else {
    EEPROM.get(ssidAddr, ssid);
    EEPROM.get(passAddr, pass); 

    Serial.print("ssid=");
    Serial.println(ssid);
    Serial.print("pass=");
    Serial.println(pass);
    Serial.println("EEPROM read!");
  }

/*
ssid not available - 1
wrong password, disconnected - 6
connected - 3
initializing - 7

ESP starts up, loading wifi credentials from the EEPROM. 
If the ESP connects successfully, 
  proceed with the rest of the application.
Else, 
  Open an open WiFi AP 
  serve the WiFi configuration webpage
  User loads the webpage on a device, enters the WiFi credentials, then submits it.
  Upon credentials submission, 
    save the credentials to the EEPROM
    shut off the WiFi AP 
    turn on the WiFi STA 
    attempt to reconnect to the WiFi 
    If the ESP connects successfully, 
      proceed with the rest of the application.
*/

  Serial.println("Attempting to connect to WiFi:");
  WiFi.begin(ssid, pass);

  while (WiFi.status() != WL_CONNECTED) {
    Serial.print("not connected: ");
    Serial.println(WiFi.status());
    delay(500);
    switch (WiFi.status())
    {
    case WL_IDLE_STATUS:
    case WL_CONNECTED:
    case 7:
      break;
    
    default:
      apIP = WiFi.softAPIP();
      Serial.print("IP Address: ");
      Serial.println(apIP[0]);
      if (apIP[0] < 1) {
        WiFi.softAP("ESP8266_wifi_config");
        Serial.println("Starting wifi SoftAP");

        indexHandler = server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send(LittleFS, "/wifi.html", String(), false);});
        wifiHandler = server.on("/wifi", HTTP_POST, [](AsyncWebServerRequest *request) {
          // upon submission of wifi credentials, grab the values, turn of the WiFi 
          // hotspot, then attempt to reconnect to the wifi router.
          ssid = request->arg("ssid");
          pass = request->arg("pass");
          ipIndex = request->arg("IPIndex").toInt();
          Serial.println("received parameters");
          Serial.println(ssid);
          Serial.println(pass);
          Serial.println(ipIndex);
          // save values to EEPROM 
          EEPROM.put(ssidAddr, ssid);
          EEPROM.put(passAddr, pass);
          EEPROM.commit();
          // turn off wifi hotspot
          WiFi.softAPdisconnect(true);
          Serial.println("stopped softAP");
          WiFi.begin(ssid, pass);
          Serial.println("started WiFi");
          localIP = WiFi.localIP();
          Serial.println(localIP);
        });

        server.begin();
      }
    }
  }

  Serial.print("Connected: ");
  Serial.println(WiFi.status());
  server.removeHandler(&indexHandler);
  server.removeHandler(&wifiHandler);
  server.reset();
  indexHandler = server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    request->send(LittleFS, "/index.html", String(), false);});
  server.begin();
}

void loop() {
  // put your main code here, to run repeatedly:
}


/*
void f1(String *str) {
  // *str = "username2";
  // modifying an Arduino C++ string through pass by reference
  str->setCharAt(3, 'z');
}

  ssid = "username1";
  ssid[2] = 'z';
  f1(&ssid);
  Serial.print("ssid=");
  Serial.println(ssid);


  ssid = "username1";
  pass = "password1";
  EEPROM.put(ssidAddr, ssid);
  Serial.print("ssid=");
  Serial.println(newSsid);
  EEPROM.get(ssidAddr, newSsid);
  Serial.print("ssid=");
  Serial.println(newSsid);


  WiFi.softAP("ESP8266_wifi_config");
  Serial.println("Starting wifi SoftAP");

  delay(10000);
  Serial.println("Stopping wifi SoftAP and starting STA");
  WiFi.softAPdisconnect(true);
  ssid = String("QUE-STARLINK");
  pass = String("Quefamily01259");
  delay(500);
  WiFi.begin(ssid, pass);

  Serial.print("IP address: "); 
  Serial.println(WiFi.localIP()); 
  delay(5000);
  Serial.print("IP address: "); 
  Serial.println(WiFi.localIP()); 
*/